backend/app/controllers/api/mrt_admin/station_controller.rb

    def create
        check,@member=check_mrt_admin
        if check
            @station=Station.new(station_params)
            @station.save
---
INSERT INTO "stations" ("linecolor", "number", "x_Pos", "y_Pos", "Trans_Num", "exit_Num", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["linecolor", "G"], ["number", 10], ["x_Pos", 12.0], ["y_Pos", 120.0], ["Trans_Num", 2], ["exit_Num", 3], ["created_at", "2023-05-09 10:34:52.069270"], ["updated_at", "2023-05-09 10:34:52.069270"]]

    def index
        @station = Station.all
---
SELECT "stations".* FROM "stations"